In [1]:
import pandas as pd

In [2]:
df_1 = pd.read_csv('../data/bank/kaggle_financial_payment_1.csv')
df_2 = pd.read_csv('../data/bank/kaggle_financial_payment_2.csv')

In [3]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 594643 entries, 0 to 594642
Data columns (total 10 columns):
step           594643 non-null int64
customer       594643 non-null object
age            594643 non-null object
gender         594643 non-null object
zipcodeOri     594643 non-null object
merchant       594643 non-null object
zipMerchant    594643 non-null object
category       594643 non-null object
amount         594643 non-null float64
fraud          594643 non-null int64
dtypes: float64(1), int64(2), object(7)
memory usage: 45.4+ MB

In [4]:
columns_to_drop = ["step", "customer", "zipMerchant", "merchant", "zipcodeOri"]
df_1b = df_1.drop(columns=columns_to_drop)
df_1b.head()

   age gender             category  amount  fraud
0  '4'    'M'  'es_transportation'    4.55      0
1  '2'    'M'  'es_transportation'   39.68      0
2  '4'    'F'  'es_transportation'   26.89      0
3  '3'    'M'  'es_transportation'   17.25      0
4  '5'    'M'  'es_transportation'   35.72      0

In [5]:
category_mapping = {
    "'es_barsandrestaurants'": 1,
    "'es_contents'": 2,
    "'es_fashion'": 3,
    "'es_food'": 4,
    "'es_health'": 5,
    "'es_home'": 6,
    "'es_hotelservices'": 7,
    "'es_hyper'": 8,
    "'es_otherservices'": 9,
    "'es_sportsandtoys'": 10,
    "'es_tech'": 11,
    "'es_transportation'": 12,
    "'es_travel'": 13,
    "'es_wellnessandbeauty'": 14,
}
df_1c = df_1b.replace({'category': category_mapping})
df_1c.head()

   age gender category  amount  fraud
0  '4'    'M'       12    4.55      0
1  '2'    'M'       12   39.68      0
2  '4'    'F'       12   26.89      0
3  '3'    'M'       12   17.25      0
4  '5'    'M'       12   35.72      0

In [6]:
gender_mapping = {
    "'M'": 1,
    "'F'": 2,
    "'U'": 3,
    "'E'": 4,
}
df_1d = df_1c.replace({'gender': gender_mapping})
df_1d.head()

   age  gender category  amount  fraud
0  '4'       1       12    4.55      0
1  '2'       1       12   39.68      0
2  '4'       2       12   26.89      0
3  '3'       1       12   17.25      0
4  '5'       1       12   35.72      0

In [7]:
age_mapping = {
    "'0'": 0,
    "'1'": 1,
    "'2'": 2,
    "'3'": 3,
    "'4'": 4,
    "'5'": 5,
    "'6'": 6,
    "'U'": 7,
}
df_1e = df_1d.replace({'age': age_mapping})
df_1e.head()

   age  gender category  amount  fraud
0    4       1       12    4.55      0
1    2       1       12   39.68      0
2    4       2       12   26.89      0
3    3       1       12   17.25      0
4    5       1       12   35.72      0

In [9]:
import pandas as pd
import numpy as np

corr = df_1e.corr()
corr.style.background_gradient()

In [ ]:
df_1b['male_gender'] = 0
df_1b['female_gender'] = 0
df_1b.loc[df_1['gender']=="'M'", 'male_gender'] = 1
df_1b.loc[df_1['gender']=="'F'", 'female_gender'] = 1
df_1b.head()

In [ ]:
columns_to_drop = ["gender"]
df_1c = df_1b.drop(columns=columns_to_drop)
df_1c.head()

In [ ]:
df_1c['cat_1'] = 0
df_1c.head()

In [ ]:
df_1c.loc[df_1['category']=="'es_barsandrestaurants'", 'cat_1'] = 1
df_1c.loc[df_1c['category']=="'es_barsandrestaurants'"].head()

In [ ]:
df_1.groupby('gender').agg({'fraud': 'sum'})

In [10]:
df_1.groupby('category').agg({'fraud': 'sum'})

                         fraud
category
'es_barsandrestaurants'    120
'es_contents'                0
'es_fashion'               116
'es_food'                    0
'es_health'               1696
'es_home'                  302
'es_hotelservices'         548
'es_hyper'                 280
'es_leisure'               474
'es_otherservices'         228
'es_sportsandtoys'        1982
'es_tech'                  158
'es_transportation'          0
'es_travel'                578
'es_wellnessandbeauty'     718

In [ ]:
df_1.groupby('age').agg({'fraud': 'sum'})

In [ ]:
df_1.groupby('age').agg({'fraud': 'count'})

In [ ]:
df_1.groupby('age').agg({'amount': 'count'})

In [ ]:
df_1.loc[df_1['fraud'] == 1]

In [ ]:
df_1.groupby('gender').agg({'gender': 'count'})

In [ ]:
df_1.groupby('gender').agg({'age': 'count'})

In [ ]:
df_1.groupby('gender').agg({'amount': 'count'})

In [ ]:
df_1['male_gender'] = 0
df_1.head()

In [ ]:
df_1.loc[df_1['gender']=="'M'", 'male_gender'] = 1

In [ ]:
df_1.head()

df_1.head()

In [ ]:
columns_to_drop = ["step", "customer", "age", "gender", "amount", "category", "zipMerchant", "merchant", "zipcodeOri"]
df_1b = df_1.drop(columns=columns_to_drop)
df_1b.head()

In [ ]:
import numpy as np
male_gender_fraud = lambda a, b: np.minimum(a, b).sum().round(decimals=1)
df_1b.corr(method=male_gender_fraud)

In [ ]:
import matplotlib.pyplot as plt

plt.matshow(df_1b.corr())

In [ ]:
import pandas as pd
import numpy as np

corr = df_1.corr()
corr.style.background_gradient()